NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/dfu_app.c
/***********************************************************************************
Copyright (c) Nordic Semiconductor ASA
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

  2. Redistributions in binary form must reproduce the above copyright notice, this
  list of conditions and the following disclaimer in the documentation and/or
  other materials provided with the distribution.

  3. Neither the name of Nordic Semiconductor ASA nor the names of other
  contributors to this software may be used to endorse or promote products
  derived from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
************************************************************************************/

#include <string.h>
#include "dfu_app.h"
#include "rtt_log.h"
#include "bootloader_util.h"
#include "timeslot.h"
#include "rbc_mesh.h"
#include "dfu_types_mesh.h"
#include "toolchain.h"
#include "bl_if.h"

#if NORDIC_SDK_VERSION >= 11
#include "nrf_nvic.h"
#endif

#include "nrf_flash.h"
#include "mesh_packet.h"
#include "rbc_mesh_common.h"
#include "timer_scheduler.h"
#include "mesh_flash.h"
#include "rand.h"
#include "transport_control.h"
#include "app_error.h"
#include "dfu_util.h"

/** Extern declaration of the hidden api function event_push. */
extern uint32_t rbc_mesh_event_push(rbc_mesh_event_t* p_event);

/*****************************************************************************
* Local defines
*****************************************************************************/
#define IRQ_ENABLED                 (0x01)      /**< Field that identifies if an interrupt is enabled. */
#define MAX_NUMBER_INTERRUPTS       (32)        /**< Maximum number of interrupts available. */

#define DFU_TX_SLOTS                (8)         /**< Number of concurrent transmits available. */
#define DFU_TX_INTERVAL_US          (100000)    /**< Time between transmits on regular interval, and base-interval on exponential. */
#define DFU_TX_INTERVAL_SLOW_US     (1000000)   /**< Time between transmits on slow regular interval. */
#define DFU_TX_START_DELAY_MASK_US  (0xFFFF)    /**< Must be power of two. */
#define DFU_TX_TIMER_MARGIN_US      (1000)      /**< Time margin for a timeout to be considered instant. */

#define TIMER_REQ_TIMEOUT           (100000000) /**< Time to wait before giving up on an ongoing request. */
#define TIMER_START_TIMEOUT         ( 50000000) /**< Time to wait for first data during a transfer. */
#define TIMER_DATA_TIMEOUT          ( 10000000) /**< Time to wait for next data during a transfer. */
/*****************************************************************************
* Local typedefs
*****************************************************************************/

typedef struct
{
    mesh_packet_t* p_packet;
    uint32_t order_time;
    bl_radio_interval_type_t interval_type;
    uint8_t repeats;
    uint8_t tx_count;
} dfu_tx_t;

/*****************************************************************************
* Static globals
*****************************************************************************/
static bl_if_cmd_handler_t          m_cmd_handler = NULL;           /**< Command handler in shared code space */
static timer_event_t                m_timer_evt;                    /**< Timer event for scheduler. */
static timer_event_t                m_tx_timer_evt;                 /**< TX event for scheduler. */
static bool                         m_tx_scheduled;                 /**< Whether the TX event is scheduled. */
static dfu_tx_t                     m_tx_slots[DFU_TX_SLOTS];       /**< TX slots for concurrent transmits. */
static prng_t                       m_prng;                         /**< PRNG for time delays. */
static tc_tx_config_t               m_tx_config;
static fwid_t*                      mp_curr_fwid;
static dfu_transfer_state_t         m_transfer_state;               /**< State of the ongoing dfu transfer. */
/*****************************************************************************
* Static functions
*****************************************************************************/
static void reset_state(void)
{
    timer_sch_abort(&m_timer_evt);
    m_transfer_state.data_progress = 0;
    m_transfer_state.role = DFU_ROLE_NONE;
    m_transfer_state.type = DFU_TYPE_NONE;
    m_transfer_state.state = DFU_STATE_INITIALIZED;
}

static uint32_t get_curr_fwid(dfu_type_t type, fwid_union_t* p_fwid)
{
    switch (type)
    {
        case DFU_TYPE_SD:
            p_fwid->sd = mp_curr_fwid->sd;
            break;
        case DFU_TYPE_BOOTLOADER:
            p_fwid->bootloader = mp_curr_fwid->bootloader;
            break;
        case DFU_TYPE_APP:
            p_fwid->app = mp_curr_fwid->app;
            break;
        default:
            return NRF_ERROR_NOT_SUPPORTED;
    }
    return NRF_SUCCESS;
}

static uint32_t next_tx_timeout(dfu_tx_t* p_tx)
{
    switch (p_tx->interval_type)
    {
        case BL_RADIO_INTERVAL_TYPE_EXPONENTIAL:
            return (p_tx->order_time + DFU_TX_INTERVAL_US * ((1 << (p_tx->tx_count)) - 1));
        case BL_RADIO_INTERVAL_TYPE_REGULAR:
            return (p_tx->order_time + DFU_TX_INTERVAL_US * p_tx->tx_count);
        case BL_RADIO_INTERVAL_TYPE_REGULAR_SLOW:
            return (p_tx->order_time + DFU_TX_INTERVAL_SLOW_US * p_tx->tx_count);
        default: /* Any unimplemented intervals will fallback to slow regular */
            return (p_tx->order_time + DFU_TX_INTERVAL_SLOW_US * p_tx->tx_count);
    }
}

