NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/dfu_app.c
static void tx_timeout(uint32_t timestamp, void* p_context)
{
    uint32_t next_timeout = timestamp + (UINT32_MAX / 2);
    for (uint32_t i = 0; i < DFU_TX_SLOTS; ++i)
    {
        if (m_tx_slots[i].p_packet)
        {
            uint32_t timeout = next_tx_timeout(&m_tx_slots[i]);
            if (TIMER_OLDER_THAN(timeout, (timestamp + DFU_TX_TIMER_MARGIN_US)))
            {
                if (tc_tx(m_tx_slots[i].p_packet, &m_tx_config) == NRF_SUCCESS)
                {
                    m_tx_slots[i].tx_count++;

                    if (m_tx_slots[i].tx_count == TX_REPEATS_INF &&
                        m_tx_slots[i].repeats  == TX_REPEATS_INF)
                    {
                        m_tx_slots[i].order_time = timeout;
                        m_tx_slots[i].tx_count = 0;
                    }
                    else if (m_tx_slots[i].tx_count >= m_tx_slots[i].repeats)
                    {
                        mesh_packet_ref_count_dec(m_tx_slots[i].p_packet);
                        memset(&m_tx_slots[i], 0, sizeof(dfu_tx_t));
                    }
                    timeout = next_tx_timeout(&m_tx_slots[i]);
                }
            }
            if (TIMER_DIFF(timeout, timestamp) < TIMER_DIFF(next_timeout, timestamp))
            {
                next_timeout = timeout;
            }
        }
    }
    m_tx_timer_evt.timestamp = next_timeout;
    APP_ERROR_CHECK(timer_sch_reschedule(&m_tx_timer_evt, next_timeout));
    m_tx_scheduled = true;
}

static void abort_timeout(uint32_t timestamp, void* p_context)
{
    __LOG("ABORT Timeout fired @%d\n", timestamp);
    bl_cmd_t abort_cmd;
    abort_cmd.type = BL_CMD_TYPE_DFU_ABORT;
    dfu_cmd_send(&abort_cmd);

    rbc_mesh_event_t evt;
    evt.type = RBC_MESH_EVENT_TYPE_DFU_END;
    evt.params.dfu.end.dfu_type = m_transfer_state.type;
    evt.params.dfu.end.role = m_transfer_state.role;
    evt.params.dfu.end.fwid = m_transfer_state.fwid;
    evt.params.dfu.end.end_reason = DFU_END_ERROR_TIMEOUT;
    reset_state();
    rbc_mesh_event_push(&evt);
}

static void timer_timeout(uint32_t timestamp, void* p_context)
{
    __LOG("Timeout fired @%d\n", timestamp);
    bl_cmd_t timeout_cmd;
    timeout_cmd.type = BL_CMD_TYPE_TIMEOUT;
    timeout_cmd.params.timeout.timer_index = 0;
    dfu_cmd_send(&timeout_cmd);
}

static void flash_op_complete(flash_op_type_t type, void* p_context)
{
    bl_cmd_t end_cmd;
    switch (type)
    {
        case FLASH_OP_TYPE_WRITE:
            end_cmd.type = BL_CMD_TYPE_FLASH_WRITE_COMPLETE;
            end_cmd.params.flash.write.p_data = p_context;
            __LOG("Write complete (0x%x)\n", p_context);
            break;
        case FLASH_OP_TYPE_ERASE:
            end_cmd.type = BL_CMD_TYPE_FLASH_ERASE_COMPLETE;
            end_cmd.params.flash.erase.p_dest = p_context;
            __LOG("Erase complete (0x%x)\n", p_context);
            break;
        case FLASH_OP_TYPE_ALL:
            end_cmd.type = BL_CMD_TYPE_FLASH_ALL_COMPLETE;
            __LOG("Flash idle.\n");
            break;
        default:
            APP_ERROR_CHECK(NRF_ERROR_INVALID_PARAM);
    }

    dfu_cmd_send(&end_cmd); /* don't care about the return code */
}

/*****************************************************************************
* Interface functions
*****************************************************************************/

uint32_t dfu_init(void)
{
    m_cmd_handler = *((bl_if_cmd_handler_t*) (END_OF_RAM - 4));
    if (m_cmd_handler == NULL ||
        (uint32_t) m_cmd_handler >= (NRF_FICR->CODESIZE * NRF_FICR->CODEPAGESIZE) ||
        (uint32_t) m_cmd_handler < BOOTLOADERADDR())
    {
        __LOG(RTT_CTRL_TEXT_RED "ERROR, command handler @0x%x\n" RTT_CTRL_TEXT_WHITE, m_cmd_handler);
        m_cmd_handler = NULL;
        return NRF_SUCCESS;
    }

    rand_prng_seed(&m_prng);

    m_timer_evt.cb           = timer_timeout;
    m_timer_evt.interval     = 0;
    m_timer_evt.p_context    = NULL;
    m_timer_evt.p_next       = NULL;
    m_tx_timer_evt.cb        = tx_timeout;
    m_tx_timer_evt.interval  = 0;
    m_tx_timer_evt.p_context = NULL;
    m_tx_timer_evt.p_next    = NULL;
    m_tx_scheduled           = true;

    /* Use standard BLE advertiser parameters */
    m_tx_config.alt_access_address = false;
    m_tx_config.first_channel = 37;
    m_tx_config.channel_map = (1 << 0) | (1 << 1) | (1 << 2); /* 37, 38, 39 */
    m_tx_config.tx_power = RBC_MESH_TXPOWER_0dBm;


    mesh_flash_init(flash_op_complete);

    bl_cmd_t init_cmd =
    {
        .type = BL_CMD_TYPE_INIT,
        .params.init =
        {
            .bl_if_version = BL_IF_VERSION,
            .event_callback = dfu_evt_handler,
            .timer_count = 1,
            .tx_slots = DFU_TX_SLOTS,
            .in_app = true
        }
    };

    uint32_t error_code = dfu_cmd_send(&init_cmd);

    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }

    bl_cmd_t fwid_cmd;
    fwid_cmd.type = BL_CMD_TYPE_INFO_GET;
    fwid_cmd.params.info.get.type = BL_INFO_TYPE_VERSION;
    fwid_cmd.params.info.get.p_entry = NULL;
    error_code = dfu_cmd_send(&fwid_cmd);
    if (error_code != NRF_SUCCESS)
    {
        /* no version info */
        return error_code;
    }

    mp_curr_fwid = &fwid_cmd.params.info.get.p_entry->version;

    bl_cmd_t enable_cmd =
    {
        .type = BL_CMD_TYPE_ENABLE,
        .params = {{0}}
    };
    return dfu_cmd_send(&enable_cmd);
}

uint32_t dfu_jump_to_bootloader(void)
{
    if (BOOTLOADERADDR() != 0xFFFFFFFF)
    {
        interrupts_disable();

#ifdef SOFTDEVICE_PRESENT
        sd_power_reset_reason_clr(0xFFFFFFFF);

#if NORDIC_SDK_VERSION >= 11
        sd_power_gpregret_set(0, RBC_MESH_GPREGRET_CODE_FORCED_REBOOT);
#else
        sd_power_gpregret_set(RBC_MESH_GPREGRET_CODE_GO_TO_APP);

#endif
        sd_nvic_SystemReset();
#else
        NRF_POWER->RESETREAS = 0xFFFFFFFF; /* erase reset-reason to avoid wrongful state-readout on reboot */
        NRF_POWER->GPREGRET = RBC_MESH_GPREGRET_CODE_FORCED_REBOOT;
        NVIC_SystemReset();

#endif //SOFTDEVICE_PRESENT

        return NRF_SUCCESS; /* unreachable */
    }
    else
    {
        /* the UICR->BOOTLOADERADDR isn't set, and we have no way to find the bootloader-address. */
        return NRF_ERROR_FORBIDDEN;
    }
}

uint32_t dfu_rx(dfu_packet_t* p_packet, uint32_t length)
{
    if (p_packet->packet_type <= RBC_MESH_APP_MAX_HANDLE)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    if (mesh_flash_in_progress())
    {
        return NRF_ERROR_BUSY;
    }

    bl_cmd_t rx_cmd =
    {
        .type = BL_CMD_TYPE_RX,
        .params.rx.p_dfu_packet = p_packet,
        .params.rx.length = length
    };

    return dfu_cmd_send(&rx_cmd);
}

uint32_t dfu_request(dfu_type_t type,
        fwid_union_t* p_fwid,
        uint32_t* p_bank_addr)
{
    if (p_fwid == NULL)
    {
        return NRF_ERROR_NULL;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_START_TARGET;
    cmd.params.dfu.start.target.type = type;
    cmd.params.dfu.start.target.fwid = *p_fwid;
    cmd.params.dfu.start.target.p_bank_start = p_bank_addr;

