NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/dfu_app.c
    uint32_t status = dfu_cmd_send(&cmd);
    if (status == NRF_SUCCESS)
    {
        m_transfer_state.type = type;
        memcpy(&m_transfer_state.fwid, p_fwid, sizeof(fwid_union_t));
        m_transfer_state.state = DFU_STATE_DFU_REQ;
        m_transfer_state.role = DFU_ROLE_TARGET;
        m_transfer_state.data_progress = 0;
    }
    return status;
}

uint32_t dfu_relay(dfu_type_t type,
        fwid_union_t* p_fwid)
{
    if (p_fwid == NULL)
    {
        return NRF_ERROR_NULL;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_START_RELAY;
    cmd.params.dfu.start.relay.type = type;
    cmd.params.dfu.start.relay.fwid = *p_fwid;
    cmd.params.dfu.start.relay.transaction_id = 0;
    uint32_t status = dfu_cmd_send(&cmd);
    if (status == NRF_SUCCESS)
    {
        m_transfer_state.type = type;
        memcpy(&m_transfer_state.fwid, p_fwid, sizeof(fwid_union_t));
        m_transfer_state.state = DFU_STATE_READY;
        m_transfer_state.role = DFU_ROLE_RELAY;
        m_transfer_state.data_progress = 0;
    }
    return status;
}

uint32_t dfu_abort(void)
{
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_ABORT;
    uint32_t error_code = dfu_cmd_send(&cmd);
    if (error_code == NRF_SUCCESS)
    {
        reset_state();
    }
    return error_code;
}

uint32_t dfu_bank_info_get(dfu_type_t type, dfu_bank_info_t* p_bank_info)
{
    if (p_bank_info == NULL)
    {
        return NRF_ERROR_NULL;
    }
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_BANK_INFO_GET;
    cmd.params.dfu.bank_info_get.bank_dfu_type = type;
    cmd.params.dfu.bank_info_get.p_bank_info = p_bank_info;
    return dfu_cmd_send(&cmd);
}

uint32_t dfu_bank_flash(dfu_type_t bank_type)
{
    bl_cmd_t cmd;
    cmd.type = BL_CMD_TYPE_DFU_BANK_FLASH;
    cmd.params.dfu.bank_flash.bank_dfu_type = bank_type;
    uint32_t error_code = dfu_cmd_send(&cmd);
    return error_code;
}

uint32_t dfu_state_get(dfu_transfer_state_t* p_dfu_transfer_state)
{
    if (p_dfu_transfer_state == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if (m_transfer_state.role == DFU_ROLE_NONE)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    memcpy(p_dfu_transfer_state, &m_transfer_state, sizeof(dfu_transfer_state_t));
    return NRF_SUCCESS;
}

uint32_t dfu_current_fwid_get(dfu_type_t type, fwid_union_t* p_fwid)
{
    if (p_fwid == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if (mp_curr_fwid == NULL)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    switch (type)
    {
        case DFU_TYPE_SD:
            p_fwid->sd = mp_curr_fwid->sd;
            break;
        case DFU_TYPE_APP:
            p_fwid->app = mp_curr_fwid->app;
            break;
        case DFU_TYPE_BOOTLOADER:
            p_fwid->bootloader = mp_curr_fwid->bootloader;
            break;
        default:
            return NRF_ERROR_INVALID_DATA;
    }

    return NRF_SUCCESS;
}

bool dfu_transfer_is_upgrade(dfu_type_t type, const fwid_union_t* p_fwid)
{
    if (mp_curr_fwid == NULL)
    {
        return false;
    }
    switch (type)
    {
        case DFU_TYPE_SD:
            return p_fwid->sd != mp_curr_fwid->sd;
        case DFU_TYPE_APP:
            return memcmp(&p_fwid->app, &mp_curr_fwid->app, sizeof(app_id_t)) == 0;
        case DFU_TYPE_BOOTLOADER:
            return memcmp(&p_fwid->bootloader, &mp_curr_fwid->bootloader, sizeof(bl_id_t)) == 0;
        default:
            return false;
    }
}


uint32_t dfu_cmd_send(bl_cmd_t* p_cmd)
{
    if (m_cmd_handler == NULL)
    {
        __LOG(RTT_CTRL_TEXT_RED "ERROR: No CMD handler!\n");
        return NRF_ERROR_INVALID_STATE;
    }
    /* Suspend flash operations for the duration of the command to avoid
       premature flash-events disturbing the flow */
    mesh_flash_set_suspended(true);
    uint32_t error_code = m_cmd_handler(p_cmd);
    mesh_flash_set_suspended(false);
    return error_code;
}

uint32_t dfu_evt_handler(bl_evt_t* p_evt)
{
    __LOG("BL EVT (0x%x)\n", p_evt->type);
    switch (p_evt->type)
    {
        case BL_EVT_TYPE_ECHO:
            __LOG("\tEcho: %s\n", p_evt->params.echo.str);
            break;
        case BL_EVT_TYPE_DFU_ABORT:
            {
                __LOG("\tAbort event. Reason: 0x%x\n", p_evt->params.dfu.abort.reason);
                rbc_mesh_event_t evt;
                evt.type = RBC_MESH_EVENT_TYPE_DFU_END;
                evt.params.dfu.end.dfu_type = m_transfer_state.type;
                evt.params.dfu.end.role = m_transfer_state.role;
                evt.params.dfu.end.fwid = m_transfer_state.fwid;
                evt.params.dfu.end.end_reason = p_evt->params.dfu.abort.reason;
                reset_state();
                rbc_mesh_event_push(&evt);
            }
            break;

        case BL_EVT_TYPE_DFU_NEW_FW:
            {
                __LOG("\tNew firmware!\n");
                rbc_mesh_event_t evt;
                evt.type = RBC_MESH_EVENT_TYPE_DFU_NEW_FW_AVAILABLE;
                evt.params.dfu.new_fw.dfu_type = p_evt->params.dfu.new_fw.fw_type;
                evt.params.dfu.new_fw.new_fwid = p_evt->params.dfu.new_fw.fwid;
                if (get_curr_fwid(
                            p_evt->params.dfu.new_fw.fw_type,
                            &evt.params.dfu.new_fw.current_fwid) == NRF_SUCCESS)
                {
                    rbc_mesh_event_push(&evt);
                }
            }
            break;

        case BL_EVT_TYPE_DFU_REQ:
            {
                __LOG("\tSource/relay request!\n");
                /* Forward to application */
                rbc_mesh_event_t evt;
                switch (p_evt->params.dfu.req.role)
                {
                    case DFU_ROLE_RELAY:
                        evt.type = RBC_MESH_EVENT_TYPE_DFU_RELAY_REQ;
                        evt.params.dfu.relay_req.dfu_type = p_evt->params.dfu.req.dfu_type;
                        evt.params.dfu.relay_req.fwid = p_evt->params.dfu.req.fwid;
                        evt.params.dfu.relay_req.authority = p_evt->params.dfu.req.dfu_type;
                        break;
                    case DFU_ROLE_SOURCE:
                        evt.type = RBC_MESH_EVENT_TYPE_DFU_SOURCE_REQ;
                        evt.params.dfu.source_req.dfu_type = p_evt->params.dfu.req.dfu_type;
                        break;
                    default:
                        return NRF_ERROR_NOT_SUPPORTED;
                }
                rbc_mesh_event_push(&evt);
            }
            break;

        case BL_EVT_TYPE_DFU_START:
            {
                __LOG("\tDFU start\n");
                if (p_evt->params.dfu.start.role == DFU_ROLE_TARGET)
                {
                    m_transfer_state.state = DFU_STATE_TARGET;
                }
                else if (p_evt->params.dfu.start.role == DFU_ROLE_RELAY)
                {
                    m_transfer_state.state = DFU_STATE_RELAY;
                }
                rbc_mesh_event_t evt;
                evt.type = RBC_MESH_EVENT_TYPE_DFU_START;
                evt.params.dfu.start.dfu_type = p_evt->params.dfu.start.dfu_type;
                evt.params.dfu.start.fwid = p_evt->params.dfu.start.fwid;
                evt.params.dfu.start.role = p_evt->params.dfu.start.role;
                rbc_mesh_event_push(&evt);
                m_timer_evt.cb = abort_timeout;
                return timer_sch_reschedule(&m_timer_evt, timer_now() + TIMER_START_TIMEOUT);
            }


        case BL_EVT_TYPE_DFU_DATA_SEGMENT_RX:
            m_transfer_state.data_progress = (uint8_t) (
                    ((uint32_t) p_evt->params.dfu.data_segment.received_segment * 100) /
                    ((uint32_t) p_evt->params.dfu.data_segment.total_segments));
            m_timer_evt.cb = abort_timeout;
            return timer_sch_reschedule(&m_timer_evt, timer_now() + TIMER_DATA_TIMEOUT);

        case BL_EVT_TYPE_DFU_END:
            {
                __LOG("\tDFU END!\n");
                rbc_mesh_event_t evt;
                evt.type = RBC_MESH_EVENT_TYPE_DFU_END;
                evt.params.dfu.end.dfu_type = p_evt->params.dfu.end.dfu_type;
                evt.params.dfu.end.fwid = p_evt->params.dfu.end.fwid;
                evt.params.dfu.end.end_reason = DFU_END_SUCCESS;
                evt.params.dfu.end.role = p_evt->params.dfu.end.role;
                reset_state();
                rbc_mesh_event_push(&evt);
                timer_sch_abort(&m_timer_evt);
            }
            break;

        case BL_EVT_TYPE_BANK_AVAILABLE:
            {
                __LOG("\tDFU BANK AVAILABLE\n");
                rbc_mesh_event_t evt;
                evt.type = RBC_MESH_EVENT_TYPE_DFU_BANK_AVAILABLE;
                evt.params.dfu.bank.dfu_type     = p_evt->params.bank_available.bank_dfu_type;
                evt.params.dfu.bank.fwid         = p_evt->params.bank_available.bank_fwid;
                evt.params.dfu.bank.is_signed    = p_evt->params.bank_available.is_signed;
                evt.params.dfu.bank.p_start_addr = p_evt->params.bank_available.p_bank_addr;
                evt.params.dfu.bank.length       = p_evt->params.bank_available.bank_length;
                rbc_mesh_event_push(&evt);
            }
            break;

