NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/dfu_app.c
        case BL_EVT_TYPE_FLASH_ERASE:
            {

                if (p_evt->params.flash.erase.start_addr & (NRF_FICR->CODEPAGESIZE - 1))
                {
                    return NRF_ERROR_INVALID_ADDR;
                }
                if (p_evt->params.flash.erase.length & (NRF_FICR->CODEPAGESIZE - 1))
                {
                    return NRF_ERROR_INVALID_LENGTH;
                }

                uint32_t error_code = mesh_flash_op_push(FLASH_OP_TYPE_ERASE, &p_evt->params.flash);
                if (error_code == NRF_SUCCESS)
                {
                    __LOG("\tErase flash at: 0x%x (length %d)\n", p_evt->params.flash.erase.start_addr, p_evt->params.flash.erase.length);
                }
                return error_code;
            }

        case BL_EVT_TYPE_FLASH_WRITE:
            {
                if (!IS_WORD_ALIGNED(p_evt->params.flash.write.start_addr))
                {
                    return NRF_ERROR_INVALID_ADDR;
                }
                if (!IS_WORD_ALIGNED(p_evt->params.flash.write.length))
                {
                    return NRF_ERROR_INVALID_LENGTH;
                }
                uint32_t error_code = mesh_flash_op_push(FLASH_OP_TYPE_WRITE, &p_evt->params.flash);
                if (error_code == NRF_SUCCESS)
                {
                    __LOG("\tWrite flash at: 0x%x (length %d)\n", p_evt->params.flash.write.start_addr, p_evt->params.flash.write.length);
                }
                return error_code;
            }

        case BL_EVT_TYPE_TX_RADIO:
            __LOG("\tRADIO TX! SLOT %d, count %d, interval: %s, handle: %x\n",
                p_evt->params.tx.radio.tx_slot,
                p_evt->params.tx.radio.tx_count,
                p_evt->params.tx.radio.interval_type == BL_RADIO_INTERVAL_TYPE_EXPONENTIAL ? "exponential" : "periodic",
                p_evt->params.tx.radio.p_dfu_packet->packet_type
            );

            if (m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet)
            {
                mesh_packet_t* p_packet = m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet;
                m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet = NULL;
                mesh_packet_ref_count_dec(p_packet);
            }
            if (mesh_packet_acquire(&m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet))
            {
                uint32_t time_now = timer_now();
                /* build packet */
                mesh_packet_set_local_addr(m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet);
                m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet->header.type = BLE_PACKET_TYPE_ADV_NONCONN_IND;
                m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet->header.length = DFU_PACKET_OVERHEAD + p_evt->params.tx.radio.length;
                ((ble_ad_t*) m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet->payload)->adv_data_type = MESH_ADV_DATA_TYPE;
                ((ble_ad_t*) m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet->payload)->data[0] = (MESH_UUID & 0xFF);
                ((ble_ad_t*) m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet->payload)->data[1] = (MESH_UUID >> 8) & 0xFF;
                ((ble_ad_t*) m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet->payload)->adv_data_length = DFU_PACKET_ADV_OVERHEAD + p_evt->params.tx.radio.length;
                memcpy(&m_tx_slots[p_evt->params.tx.radio.tx_slot].p_packet->payload[4], p_evt->params.tx.radio.p_dfu_packet, p_evt->params.tx.radio.length);

                /* fill other fields in the TX slot. */
                m_tx_slots[p_evt->params.tx.radio.tx_slot].interval_type = p_evt->params.tx.radio.interval_type;
                m_tx_slots[p_evt->params.tx.radio.tx_slot].repeats = p_evt->params.tx.radio.tx_count;
                m_tx_slots[p_evt->params.tx.radio.tx_slot].tx_count = 0;
                m_tx_slots[p_evt->params.tx.radio.tx_slot].order_time = time_now + DFU_TX_TIMER_MARGIN_US + (rand_prng_get(&m_prng) & (DFU_TX_START_DELAY_MASK_US));

                /* Fire away */
                if (!m_tx_scheduled || TIMER_DIFF(m_tx_slots[p_evt->params.tx.radio.tx_slot].order_time, time_now) < TIMER_DIFF(m_tx_timer_evt.timestamp, time_now))
                {
                    m_tx_scheduled = true;
                    timer_sch_reschedule(&m_tx_timer_evt,
                            m_tx_slots[p_evt->params.tx.radio.tx_slot].order_time);
                }
            }
            else
            {
                return NRF_ERROR_NO_MEM;
            }
            break;
        case BL_EVT_TYPE_TX_SERIAL:
            __LOG("\tSERIAL TX!\n");
            break;

        case BL_EVT_TYPE_TX_ABORT:
            if (p_evt->params.tx.abort.tx_slot >= DFU_TX_SLOTS)
            {
                return NRF_ERROR_INVALID_PARAM;
            }
            if (m_tx_slots[p_evt->params.tx.abort.tx_slot].p_packet == NULL)
            {
                return NRF_ERROR_INVALID_STATE;
            }
            else
            {
                /* set to NULL before deleting reference to avoid freak orphan
                   packet */
                mesh_packet_t* p_packet = m_tx_slots[p_evt->params.tx.abort.tx_slot].p_packet;
                m_tx_slots[p_evt->params.tx.abort.tx_slot].p_packet = NULL;
                mesh_packet_ref_count_dec(p_packet);
                return NRF_SUCCESS;
            }

        case BL_EVT_TYPE_TIMER_SET:
            {
                m_timer_evt.cb = timer_timeout;
                timestamp_t set_time = timer_now() + p_evt->params.timer.set.delay_us;
                APP_ERROR_CHECK(timer_sch_reschedule(&m_timer_evt, set_time));
                __LOG("\tTIMER set: %uus delay (@%u)\n", p_evt->params.timer.set.delay_us, set_time);
                return NRF_SUCCESS;
            }

        case BL_EVT_TYPE_TIMER_ABORT:
            __LOG("\tTIMER abort: %d\n", p_evt->params.timer.abort.index);
            return timer_sch_abort(&m_timer_evt);

        case BL_EVT_TYPE_ERROR:
            app_error_handler(p_evt->params.error.error_code,
                              p_evt->params.error.line,
                              (uint8_t*) p_evt->params.error.p_file);
            break;
        default:
            __LOG("\tUNSUPPORTED EVENT\n");
            return NRF_ERROR_NOT_SUPPORTED;
    }
    return NRF_SUCCESS;
}

